geosmall/Arduino_STM32_LL/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Flight Controller boards

Flight_ctrl.name=Flight Controllers

Flight_ctrl.build.core=arduino
Flight_ctrl.build.board=Flight_ctrl
Flight_ctrl.build.variant_h=variant_{build.board}.h
Flight_ctrl.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# REVO_F405RG board
Flight_ctrl.menu.pnum.REVO_F405RG=Revo F405RG
Flight_ctrl.menu.pnum.REVO_F405RG.upload.maximum_size=1048576
Flight_ctrl.menu.pnum.REVO_F405RG.upload.maximum_data_size=131072
Flight_ctrl.menu.pnum.REVO_F405RG.build.mcu=cortex-m4
Flight_ctrl.menu.pnum.REVO_F405RG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Flight_ctrl.menu.pnum.REVO_F405RG.build.board=REVO_F405RG
Flight_ctrl.menu.pnum.REVO_F405RG.build.series=STM32F4xx
Flight_ctrl.menu.pnum.REVO_F405RG.build.product_line=STM32F405xx
Flight_ctrl.menu.pnum.REVO_F405RG.build.variant=FCs/REVO_F405RG
Flight_ctrl.menu.pnum.REVO_F405RG.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Flight_ctrl.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Flight_ctrl.menu.upload_method.swdMethod.upload.protocol=0
Flight_ctrl.menu.upload_method.swdMethod.upload.options=-g
Flight_ctrl.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Flight_ctrl.menu.upload_method.serialMethod.upload.protocol=1
Flight_ctrl.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Flight_ctrl.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Flight_ctrl.menu.upload_method.dfuMethod.upload.protocol=2
Flight_ctrl.menu.upload_method.dfuMethod.upload.options=-g
Flight_ctrl.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Nucleo 64 boards

Nucleo_64.name=Nucleo-64

Nucleo_64.build.core=arduino
Nucleo_64.build.board=Nucleo_64
Nucleo_64.build.variant_h=variant_{build.board}.h
Nucleo_64.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# NUCLEO_F411RE board with MPU6000
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K=Nucleo F411RE /w MPU6000 (no INT)
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.node="NODE_F411RE,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.board=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.product_line=STM32F411xE
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.variant=STM32F4xx/F411RE_MPU6K
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6K.build.cmsis_lib_gcc=arm_cortexM4lf_math

# NUCLEO_F411RE board with MPU6000 using INT
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT=Nucleo F411RE /w MPU6000 (INT)
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.node="NODE_F411RE,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.board=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.product_line=STM32F411xE
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.variant=STM32F4xx/F411RE_MPU6K_INT
Nucleo_64.menu.pnum.NUCLEO_F411RE_MPU6KINT.build.cmsis_lib_gcc=arm_cortexM4lf_math

# NUCLEO_F411RE board with ICM42688P
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P=Nucleo F411RE w/ ICM42688P (no INT)
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.node="NODE_F411RE_ICM42688P,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.board=NUCLEO_F411RE_ICM42688P
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.product_line=STM32F411xE
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.variant=STM32F4xx/F411RE_ICM42688P
Nucleo_64.menu.pnum.NUCLEO_F411RE_ICM42688P.build.cmsis_lib_gcc=arm_cortexM4lf_math

# NUCLEO_F405RG board with MPU6000
Nucleo_64.menu.pnum.NUCLEO_F405RG=Nucleo F405RG W/ MPU6000
Nucleo_64.menu.pnum.NUCLEO_F405RG.node="NODE_F405RG,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F405RG.upload.maximum_size=1048576
Nucleo_64.menu.pnum.NUCLEO_F405RG.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.board=NUCLEO_F405RG
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.product_line=STM32F405xx
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.variant=STM32F4xx/F405RGT_F415RGT
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Nucleo_64.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_64.menu.upload_method.swdMethod.upload.protocol=0
Nucleo_64.menu.upload_method.swdMethod.upload.options=-g
Nucleo_64.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_64.menu.upload_method.serialMethod.upload.protocol=1
Nucleo_64.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Nucleo_64.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_64.menu.upload_method.dfuMethod.upload.protocol=2
Nucleo_64.menu.upload_method.dfuMethod.upload.options=-g
Nucleo_64.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Nucleo_64.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Nucleo_64.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Nucleo_64.menu.upload_method.jlinkMethod=JLink Ozone Debug
Nucleo_64.menu.upload_method.jlinkMethod.upload.device=STM32F405RG
Nucleo_64.menu.upload_method.jlinkMethod.upload.protocol=SWD
Nucleo_64.menu.upload_method.jlinkMethod.upload.options=-g
Nucleo_64.menu.upload_method.jlinkMethod.upload.tool=jlink_upload

################################################################################
# Generic F4

